In [9]:
# inicialmete importar as bibliotecas
import pandas as pd
import numpy as np
np.random.seed(123)

In [10]:
# crie um uma matriz de 6 linha se 7 colunas
x=np.random.randint(0,100,42).reshape(6,7)
x

array([[66, 92, 98, 17, 83, 57, 86],
       [97, 96, 47, 73, 32, 46, 96],
       [25, 83, 78, 36, 96, 80, 68],
       [49, 55, 67,  2, 84, 39, 66],
       [84, 47, 61, 48,  7, 99, 92],
       [52, 97, 85, 94, 27, 34, 97]])

In [11]:
# com os dados da matriz acima crie um DataFrame
df=pd.DataFrame(x)
df

    0   1   2   3   4   5   6
0  66  92  98  17  83  57  86
1  97  96  47  73  32  46  96
2  25  83  78  36  96  80  68
3  49  55  67   2  84  39  66
4  84  47  61  48   7  99  92
5  52  97  85  94  27  34  97

In [12]:
# crie um DataFrame com índice em letras minúscula
# e coluna com letras maiúsculas
df=pd.DataFrame(data=x,index=['a','b','c','d','e','f'],columns=['A','B','C','D','E','F','G'])
df

    A   B   C   D   E   F   G
a  66  92  98  17  83  57  86
b  97  96  47  73  32  46  96
c  25  83  78  36  96  80  68
d  49  55  67   2  84  39  66
e  84  47  61  48   7  99  92
f  52  97  85  94  27  34  97

In [13]:
# encontre os valores médios do DataFrame
# para as todas as colunas
df.mean()

A    62.166667
B    78.333333
C    72.666667
D    45.000000
E    54.833333
F    59.166667
G    84.166667
dtype: float64

In [14]:
# encontre o valor médio do DataFrame
# para a primeira coluna
df["A"].mean()

62.166666666666664

In [22]:
# indentifique quais valores são maiores que 45
# escrevendo um novo DataFrame com OS NÚMEROS
df1=df[df > 45] 
df1

      A   B   C     D     E     F   G
a  66.0  92  98   NaN  83.0  57.0  86
b  97.0  96  47  73.0   NaN  46.0  96
c   NaN  83  78   NaN  96.0  80.0  68
d  49.0  55  67   NaN  84.0   NaN  66
e  84.0  47  61  48.0   NaN  99.0  92
f  52.0  97  85  94.0   NaN   NaN  97

In [24]:
# encontre a quantidade de valores maiores 
# que 45 
qdt = (df >= 45).sum()
print(qdt)

A    5
B    6
C    6
D    3
E    3
F    4
G    6
dtype: int64

In [27]:
# encontre o valor médio para o 
# DataFrame com valores maiores que 45
df1.mean()

A    69.600000
B    78.333333
C    72.666667
D    71.666667
E    87.666667
F    70.500000
G    84.166667
dtype: float64

In [32]:
# crie um novo DataFrame com valores maior que 45
df2 = df1
df2

      A   B   C     D     E     F   G
a  66.0  92  98   NaN  83.0  57.0  86
b  97.0  96  47  73.0   NaN  46.0  96
c   NaN  83  78   NaN  96.0  80.0  68
d  49.0  55  67   NaN  84.0   NaN  66
e  84.0  47  61  48.0   NaN  99.0  92
f  52.0  97  85  94.0   NaN   NaN  97

In [45]:
# excluir todas as colunas com NaN
df2.dropna(axis=1, how='any')

    B   C   G
a  92  98  86
b  96  47  96
c  83  78  68
d  55  67  66
e  47  61  92
f  97  85  97

In [47]:
# no novo DataFrame substitua 
# os valores NaN pela media
# do valor da coluna
df2.fillna(value=df2.mean())

      A   B   C          D          E     F   G
a  66.0  92  98  71.666667  83.000000  57.0  86
b  97.0  96  47  73.000000  87.666667  46.0  96
c  69.6  83  78  71.666667  96.000000  80.0  68
d  49.0  55  67  71.666667  84.000000  70.5  66
e  84.0  47  61  48.000000  87.666667  99.0  92
f  52.0  97  85  94.000000  87.666667  70.5  97

In [55]:
# torne essas mudanças permanente
df2.dropna(axis=1, how='any',inplace=True)
df2

    B   C   G
a  92  98  86
b  96  47  96
c  83  78  68
d  55  67  66
e  47  61  92
f  97  85  97

In [57]:
# mostrar aleatoriamente 4 linhas 
# com as mudanças  permanente
df2.sample(4)

    B   C   G
f  97  85  97
b  96  47  96
c  83  78  68
d  55  67  66